Model: "trader_net"
________________________________________________________________________________
Layer (type)                        Output Shape                    Param #     
================================================================================
tail (Tail)                         (None, 128, 32)                 672         
________________________________________________________________________________
bottleneck (Bottleneck)             (None, 128, 32)                 696         
________________________________________________________________________________
bottleneck_1 (Bottleneck)           (None, 128, 32)                 696         
________________________________________________________________________________
bottleneck_2 (Bottleneck)           (None, 128, 32)                 696         
________________________________________________________________________________
downsample (Downsample)             (None, 64, 64)                  8048        
________________________________________________________________________________
bottleneck_3 (Bottleneck)           (None, 64, 64)                  2416        
________________________________________________________________________________
bottleneck_4 (Bottleneck)           (None, 64, 64)                  2416        
________________________________________________________________________________
bottleneck_5 (Bottleneck)           (None, 64, 64)                  2416        
________________________________________________________________________________
downsample_1 (Downsample)           (None, 32, 128)                 31456       
________________________________________________________________________________
bottleneck_6 (Bottleneck)           (None, 32, 128)                 8928        
________________________________________________________________________________
bottleneck_7 (Bottleneck)           (None, 32, 128)                 8928        
________________________________________________________________________________
bottleneck_8 (Bottleneck)           (None, 32, 128)                 8928        
________________________________________________________________________________
bottleneck_9 (Bottleneck)           (None, 32, 128)                 8928        
________________________________________________________________________________
bottleneck_10 (Bottleneck)          (None, 32, 128)                 8928        
________________________________________________________________________________
downsample_2 (Downsample)           (None, 16, 256)                 124352      
________________________________________________________________________________
bottleneck_11 (Bottleneck)          (None, 16, 256)                 34240       
________________________________________________________________________________
bottleneck_12 (Bottleneck)          (None, 16, 256)                 34240       
________________________________________________________________________________
downsample_3 (Downsample)           (None, 8, 512)                  494464      
________________________________________________________________________________
final_bn (BatchNormalization)       (None, 8, 512)                  2048        
________________________________________________________________________________
final_relu (ReLU)                   (None, 8, 512)                  0           
________________________________________________________________________________
multi_head_attention (MultiHeadAtte (None, None, 512)               1050625     
________________________________________________________________________________
layer_normalization (LayerNormaliza multiple                        1024        
________________________________________________________________________________
dropout (Dropout)                   (None, None, 512)               0           
________________________________________________________________________________
head (Head)                         multiple                        264195      
================================================================================
Total params: 2,099,340
Trainable params: 2,092,316
Non-trainable params: 7,024
________________________________________________________________________________
