Model: "trader_net"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
tail (Tail)                  (None, 128, 32)           672
_________________________________________________________________
bottleneck (Bottleneck)      (None, 128, 32)           1184
_________________________________________________________________
bottleneck_1 (Bottleneck)    (None, 128, 32)           1184
_________________________________________________________________
bottleneck_2 (Bottleneck)    (None, 128, 32)           1184
_________________________________________________________________
downsample (Downsample)      (None, 64, 64)            9920
_________________________________________________________________
bottleneck_3 (Bottleneck)    (None, 64, 64)            4416
_________________________________________________________________
bottleneck_4 (Bottleneck)    (None, 64, 64)            4416
_________________________________________________________________
bottleneck_5 (Bottleneck)    (None, 64, 64)            4416
_________________________________________________________________
bottleneck_6 (Bottleneck)    (None, 64, 64)            4416
_________________________________________________________________
downsample_1 (Downsample)    (None, 32, 128)           39296
_________________________________________________________________
bottleneck_7 (Bottleneck)    (None, 32, 128)           17024
_________________________________________________________________
bottleneck_8 (Bottleneck)    (None, 32, 128)           17024
_________________________________________________________________
bottleneck_9 (Bottleneck)    (None, 32, 128)           17024
_________________________________________________________________
bottleneck_10 (Bottleneck)   (None, 32, 128)           17024
_________________________________________________________________
bottleneck_11 (Bottleneck)   (None, 32, 128)           17024
_________________________________________________________________
bottleneck_12 (Bottleneck)   (None, 32, 128)           17024
_________________________________________________________________
downsample_2 (Downsample)    (None, 16, 256)           156416
_________________________________________________________________
bottleneck_13 (Bottleneck)   (None, 16, 256)           66816
_________________________________________________________________
bottleneck_14 (Bottleneck)   (None, 16, 256)           66816
_________________________________________________________________
bottleneck_15 (Bottleneck)   (None, 16, 256)           66816
_________________________________________________________________
downsample_3 (Downsample)    (None, 8, 512)            624128
_________________________________________________________________
bn (BatchNormalization)      (None, 8, 512)            2048
_________________________________________________________________
relu (ReLU)                  (None, 8, 512)            0
_________________________________________________________________
attn (MultiHeadAttention)    (None, None, 512)         1051649
_________________________________________________________________
head (ClassificationHead)    (None, 5)                 2565
=================================================================
Total params: 2,210,502
Trainable params: 2,203,318
Non-trainable params: 7,184
_________________________________________________________________

I0911 17:22:30.581497 139806504449856 util.py:34] Model checkpoint dir: /artifacts/checkpoint/20190911-172226
I0911 17:22:30.581649 139806504449856 util.py:36] Tensorboard log dir: /artifacts/tblogs
I0911 17:22:30.581711 139806504449856 util.py:46] ReduceLROnPlateau: {'monitor': 'loss', 'factor': 0.5, 'patience': 3, 'min_lr': 0.0001}
I0911 17:22:30.581789 139806504449856 util.py:55] EarlyStopping: {'monitor': 'loss', 'factor': 0.5, 'patience': 3, 'min_lr': 0.0001}
I0911 17:22:30.582913 139806504449856 train.py:39] Reading TFRecords from: /data/tfrecords/part-r-*
I0911 17:22:30.593889 139806504449856 train.py:67] Taking 10000 examples for validation

--classes=5 --lr=0.005
